package Chapter08;

// Chapter08 예외처리 연습문제 풀이
public class Ch08_Excercise {
	/*
	 * [8-1] 예외처리의 정의와 목적에 대해서 설명하시오.
	 * 정의 : 프로그램 실행 시 발생할 수 있는 예기치 못한 예외에 대비한 코드를 작성하는 것
	 * 목적 : 프로그램의 비정상 종료를 막고, 정상적인 실행상태를 유지하는 것
	 */
	
	/*
	 * [8-5] 아래의 코드가 수행되었을 때의 실행결과를 적으시오.
	 * 1
	 * 3
	 * 5
	 * 6	// 마지막 이거... 때문에 틀림
	 * 1
	 * 2
	 * 5
	 * 6
	 */
	
	/*
	 * [8-6] 아래의 코드가 수행되었을 때의 실행결과를 적으시오.
	 * 3
	 * 5
	 */
	
	
	/* System.exit(0); 로 프로그램이 즉시 종료되기 때문에 finally 블럭이 수행되지 않는다.
	 * 
	 * [8-7] 아래의 코드가 수행되었을 때의 실행결과를 적으시오.
	 * 1
	 * 5
	 * 1
	 * 2
	 * 5
	 * 6
	 */
	
	/*
	 * [8-10] 아래의 코드가 수행되었을 때의 실행결과를 적으시오.
	 * 2
	 * 4
	 * 7
	 */
}
